---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ClippingIsDisabled
source: html/6c5f6778-bf8d-b66f-4683-934bd0f66fe7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ClippingIsDisabled Property

View has clipping disabled. It causes view to draw too many elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId ClippingIsDisabled { get; }
```